


file = open("newfile.txt", "a")
file.write("Всего с наценкой: " + str(c) + "р" + "  ---  " + "Прибыль с одной штуки: " + str(w) + "р" + "\n")
file.write("Итого за все: " + str(f) + "р" + "  ---  " + "Прибыль за все :" + ee + "р")
file.close()


# def mem_add():
#
# file = open("newfile.txt", "a")
# file.write("Всего с наценкой: " + str(c) + "р" + "  ---  " + "Прибыль с одной штуки: " + str(w) + "р" + "\n")
# file.write("Итого за все: " + str(f) + "р" + "  ---  " + "Прибыль за все :" + ee + "р")
# file.close()
#
#
#
# while True:
#     a = float(input("Введите первое число:"))
#     b = float(input("Введите второе число:"))
#     what_do = c = a / 100 * b + a
#     # Прибыль за штуку
#     w = a / 100 * b
#     print("Всего с наценкой: " + str(c) + "р" + "  ---  " + "Прибыль с одной штуки: " + str(w) + "р")
#     d = float(input("Введите количество продукции: "))
#     # Сумма общая на все количество товара
#     f = c * d
#     # Прибыль общая на все количество товара
#     e = w * d
#     ee = format(e, '.2f')
#
#     print("Итого за все: " + str(f) + "р" + "  ---  " + "Прибыль за все :" + ee + "р")
#     #print("Итого за все: " + str(mem_1[0]) + "р" + "  ---  " + "Прибыль за все :" + str(mem_1[1]) + "р")
#     #print(len(mem_1))
#
#     mem_add()
#
#


